In [3]:
import pandas as pd
import numpy as np

In [4]:
mi_serie=pd.Series(np.array([x for x in "abcdefgh"]))

In [5]:
mi_serie

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [6]:
[x for x in "abcdefgh"]

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [8]:
np.array([x for x in "abcdefgh"])

array(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='<U1')

In [9]:
pd.Series(np.array([x for x in "abcdefgh"]))

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [10]:
type(mi_serie)

pandas.core.series.Series

In [11]:
mi_serie.dtype

dtype('O')

In [12]:
mi_serie.values

array(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype=object)

In [13]:
mi_serie.index

RangeIndex(start=0, stop=8, step=1)

In [14]:
mi_diccionario={"Juan":5,"Carmen":8,"Luis":4,"Ana":9,"Lucía":7}

In [17]:
mi_diccionario.keys()

dict_keys(['Juan', 'Carmen', 'Luis', 'Ana', 'Lucía'])

In [19]:
mi_diccionario.values()

dict_values([5, 8, 4, 9, 7])

In [20]:
pd.Series(mi_diccionario)

Juan      5
Carmen    8
Luis      4
Ana       9
Lucía     7
dtype: int64

In [21]:
edades=pd.Series(mi_diccionario)

In [31]:
edades[["Lucía","Luis"]]

Lucía    7
Luis     4
dtype: int64

In [25]:
edades["Luis":]

Luis     4
Ana      9
Lucía    7
dtype: int64

In [28]:
edades.iloc[-1]

7

In [29]:
edades.loc["Ana"]

9

In [36]:
numeros=pd.Series({"Lucía":67,"Juan":15,"Carmen":28,"Luis":44,"Ana":59,"Pedro":0})

In [37]:

numeros

Lucía     67
Juan      15
Carmen    28
Luis      44
Ana       59
Pedro      0
dtype: int64

In [38]:
edades

Juan      5
Carmen    8
Luis      4
Ana       9
Lucía     7
dtype: int64

In [39]:
numeros+edades

Ana       68.0
Carmen    36.0
Juan      20.0
Lucía     74.0
Luis      48.0
Pedro      NaN
dtype: float64

In [40]:
edades

Juan      5
Carmen    8
Luis      4
Ana       9
Lucía     7
dtype: int64

In [42]:
edades.index[0:3:2]

Index(['Juan', 'Luis'], dtype='object')

In [43]:
edades[edades.index[0:3:2]]

Juan    5
Luis    4
dtype: int64

In [44]:
edades[['Juan', 'Luis']]

Juan    5
Luis    4
dtype: int64

edades.iloc[0:3:2]

In [46]:
edades[[x for x in edades.index if "L" in x]]

Luis     4
Lucía    7
dtype: int64

In [ ]:
[x for x in edades.index if "L" in x]

In [47]:
edades.index

Index(['Juan', 'Carmen', 'Luis', 'Ana', 'Lucía'], dtype='object')

In [48]:
np.sum(edades)

33

### ¡¡¡MUY INTERESANTE!!!

In [53]:
edades

Juan      5
Carmen    5
Luis      4
Ana       9
Lucía     7
dtype: int64

In [51]:
edades["Carmen"]=5

In [54]:
edades[[True,False,False,True,False]]

Juan    5
Ana     9
dtype: int64

In [55]:
edades[edades.values>4]

Juan      5
Carmen    5
Ana       9
Lucía     7
dtype: int64

In [56]:
edades

Juan      5
Carmen    5
Luis      4
Ana       9
Lucía     7
dtype: int64

In [57]:
edades.values

array([5, 5, 4, 9, 7], dtype=int64)

In [58]:
edades.values>4

array([ True,  True, False,  True,  True])

In [59]:
edades[np.array([ True,  True, False,  True,  True])]

Juan      5
Carmen    5
Ana       9
Lucía     7
dtype: int64

In [60]:
edades["Luisa"]=6

In [61]:
edades

Juan      5
Carmen    5
Luis      4
Ana       9
Lucía     7
Luisa     6
dtype: int64

In [63]:
edades2=pd.Series([5,8],index=["Martin","Rosa"])

In [64]:
edades2

Martin    5
Rosa      8
dtype: int64

In [65]:
edades

Juan      5
Carmen    5
Luis      4
Ana       9
Lucía     7
Luisa     6
dtype: int64

In [66]:
pd.concat([edades,edades2])

Juan      5
Carmen    5
Luis      4
Ana       9
Lucía     7
Luisa     6
Martin    5
Rosa      8
dtype: int64

In [69]:
edades2=pd.Series([5,8,11],index=["Martin","Rosa","Juan"])

In [72]:
edades=pd.concat([edades,edades2])

In [73]:
edades["Juan"]

Juan     5
Juan    11
dtype: int64

# Dataframes

Los dataframes son tablas. Tienen índices para las filas e índices para las columnas

In [74]:
diccionario = {
    "nombre": np.array(["Julio", "Nuria", "Jose", "Luis", "Daniel", "Javier", "Alberto", "Lourdes"]),
    "edad": np.array(  [     22,      26,     28,     25,       24,       24,        24,        26]),
    "sexo": np.array(  ["Hombre", "Mujer","Hombre","Hombre","Hombre","Hombre", "Hombre",  "Mujer" ]),
}

In [75]:
mi_df=pd.DataFrame(diccionario)

In [76]:
mi_df

    nombre  edad    sexo
0    Julio    22  Hombre
1    Nuria    26   Mujer
2     Jose    28  Hombre
3     Luis    25  Hombre
4   Daniel    24  Hombre
5   Javier    24  Hombre
6  Alberto    24  Hombre
7  Lourdes    26   Mujer

In [77]:
mi_df.columns

Index(['nombre', 'edad', 'sexo'], dtype='object')

In [78]:
mi_df.index

RangeIndex(start=0, stop=8, step=1)

In [79]:
mi_df["nombre"]

0      Julio
1      Nuria
2       Jose
3       Luis
4     Daniel
5     Javier
6    Alberto
7    Lourdes
Name: nombre, dtype: object

In [80]:
mi_df[["nombre","edad"]]

    nombre  edad
0    Julio    22
1    Nuria    26
2     Jose    28
3     Luis    25
4   Daniel    24
5   Javier    24
6  Alberto    24
7  Lourdes    26

In [81]:
mi_df["nombre"]

0      Julio
1      Nuria
2       Jose
3       Luis
4     Daniel
5     Javier
6    Alberto
7    Lourdes
Name: nombre, dtype: object

In [82]:
mi_df[["nombre"]]

    nombre
0    Julio
1    Nuria
2     Jose
3     Luis
4   Daniel
5   Javier
6  Alberto
7  Lourdes

In [83]:
mi_df.values

array([['Julio', 22, 'Hombre'],
       ['Nuria', 26, 'Mujer'],
       ['Jose', 28, 'Hombre'],
       ['Luis', 25, 'Hombre'],
       ['Daniel', 24, 'Hombre'],
       ['Javier', 24, 'Hombre'],
       ['Alberto', 24, 'Hombre'],
       ['Lourdes', 26, 'Mujer']], dtype=object)

In [87]:
mi_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nombre  8 non-null      object
 1   edad    8 non-null      int32
 2   sexo    8 non-null      object
dtypes: int32(1), object(2)
memory usage: 288.0+ bytes

In [88]:
mi_df

    nombre  edad    sexo
0    Julio    22  Hombre
1    Nuria    26   Mujer
2     Jose    28  Hombre
3     Luis    25  Hombre
4   Daniel    24  Hombre
5   Javier    24  Hombre
6  Alberto    24  Hombre
7  Lourdes    26   Mujer

In [89]:
mi_df.index=[10*x for x in mi_df.index]

In [90]:
mi_df

     nombre  edad    sexo
0     Julio    22  Hombre
10    Nuria    26   Mujer
20     Jose    28  Hombre
30     Luis    25  Hombre
40   Daniel    24  Hombre
50   Javier    24  Hombre
60  Alberto    24  Hombre
70  Lourdes    26   Mujer

In [91]:
mi_df.index=10*mi_df.index

In [92]:
mi_df

      nombre  edad    sexo
0      Julio    22  Hombre
100    Nuria    26   Mujer
200     Jose    28  Hombre
300     Luis    25  Hombre
400   Daniel    24  Hombre
500   Javier    24  Hombre
600  Alberto    24  Hombre
700  Lourdes    26   Mujer

.loc y .iloc

In [94]:
mi_df.loc[[100,400,600],["nombre"]]

      nombre
100    Nuria
400   Daniel
600  Alberto

In [95]:
mi_df.loc[:,["nombre"]]

      nombre
0      Julio
100    Nuria
200     Jose
300     Luis
400   Daniel
500   Javier
600  Alberto
700  Lourdes

In [96]:
mi_df.iloc[0:4,0:2]

    nombre  edad
0    Julio    22
100  Nuria    26
200   Jose    28
300   Luis    25

In [97]:
mi_df

      nombre  edad    sexo
0      Julio    22  Hombre
100    Nuria    26   Mujer
200     Jose    28  Hombre
300     Luis    25  Hombre
400   Daniel    24  Hombre
500   Javier    24  Hombre
600  Alberto    24  Hombre
700  Lourdes    26   Mujer

In [98]:
 mi_df["es_rubio"]=np.array([False, True, False, False, False, True, False, False])

mi_df

In [99]:
mi_df

      nombre  edad    sexo  es_rubio
0      Julio    22  Hombre     False
100    Nuria    26   Mujer      True
200     Jose    28  Hombre     False
300     Luis    25  Hombre     False
400   Daniel    24  Hombre     False
500   Javier    24  Hombre      True
600  Alberto    24  Hombre     False
700  Lourdes    26   Mujer     False

In [102]:
mi_df

             0      100     200     300     400     500      600      700
nombre     Julio  Nuria    Jose    Luis  Daniel  Javier  Alberto  Lourdes
edad          22     26      28      25      24      24       24       26
sexo      Hombre  Mujer  Hombre  Hombre  Hombre  Hombre   Hombre    Mujer
es_rubio   False   True   False   False   False    True    False    False

In [104]:
mi_df.T[0].astype("float32")

ValueError: could not convert string to float: 'Julio'

In [111]:
mi_df.T[0].astype("U32")

nombre       Julio
edad            22
sexo        Hombre
es_rubio     False
Name: 0, dtype: object

## Indexado booleano

In [129]:
mi_df
mi_df["es_rubio"]=np.where(mi_df["es_rubio"]==False,"No","Sí")

In [130]:
mi_df

      nombre  edad    sexo es_rubio
0      Julio    22  Hombre       No
100    Nuria    26   Mujer       Sí
200     Jose    28  Hombre       No
300     Luis    25  Hombre       No
400   Daniel    24  Hombre       No
500   Javier    24  Hombre       Sí
600  Alberto    24  Hombre       No
700  Lourdes    26   Mujer       No

In [114]:
mi_df["edad"]

0      22
100    26
200    28
300    25
400    24
500    24
600    24
700    26
Name: edad, dtype: int32

In [115]:
mi_df["edad"]>25

0      False
100     True
200     True
300    False
400    False
500    False
600    False
700     True
Name: edad, dtype: bool

In [118]:
mi_df[mi_df["edad"]>25][["nombre"]]

      nombre
100    Nuria
200     Jose
700  Lourdes

In [132]:
mi_df[(mi_df["edad"]>25) & (mi_df["es_rubio"]=='Sí')]

    nombre  edad   sexo es_rubio
100  Nuria    26  Mujer       Sí

In [135]:
mi_df[(mi_df["edad"]>25)]

      nombre  edad    sexo es_rubio
100    Nuria    26   Mujer       Sí
200     Jose    28  Hombre       No
700  Lourdes    26   Mujer       No

In [137]:
mi_df[(mi_df["edad"]>25) | ~(mi_df["es_rubio"]=='Sí')]

      nombre  edad    sexo es_rubio
0      Julio    22  Hombre       No
100    Nuria    26   Mujer       Sí
200     Jose    28  Hombre       No
300     Luis    25  Hombre       No
400   Daniel    24  Hombre       No
600  Alberto    24  Hombre       No
700  Lourdes    26   Mujer       No

In [138]:
mi_df["edad"]==26

0      False
100     True
200    False
300    False
400    False
500    False
600    False
700     True
Name: edad, dtype: bool

In [139]:
mi_df[mi_df["edad"]==26]

      nombre  edad   sexo es_rubio
100    Nuria    26  Mujer       Sí
700  Lourdes    26  Mujer       No

In [141]:
mi_df["es_rubio"]=="Sí"

0      False
100     True
200    False
300    False
400    False
500     True
600    False
700    False
Name: es_rubio, dtype: bool

In [142]:
# alt gr + 4 == ~ y sirve para negar la condición

~(mi_df["es_rubio"]=="Sí")

0       True
100    False
200     True
300     True
400     True
500    False
600     True
700     True
Name: es_rubio, dtype: bool

Funciones en dataframes

In [143]:
df_numerico = pd.DataFrame({
        "a": np.random.normal(0,1, (7,)), # Generamos datos aleatorios
        "b": np.random.normal(1,3, (7,)), # con np.random.normal, generando
        "c": np.random.normal(2,5, (7,)), # arrays unidimensionales
        "d": np.random.normal(-5,4,(7,)), # de longitud 7
        "e": np.random.normal(3,0.5,(7,))
    })

In [144]:
df_numerico

          a         b          c         d         e
0  0.633585  3.262458  10.629319 -4.817788  3.481027
1  0.285569  0.182875   7.741725 -5.464647  3.780054
2 -0.808778  1.596246   2.129944 -6.556657  3.121704
3 -0.197303  2.959336   7.393151 -1.068151  3.325741
4  0.132563 -2.834122  -1.891759 -2.273553  2.696656
5  0.205545  2.212324   8.953772 -3.426752  2.220309
6  0.721464 -0.142118   8.998396 -7.495159  2.552185

In [145]:
df_numerico.values

array([[ 0.63358483,  3.26245767, 10.62931912, -4.81778788,  3.4810275 ],
       [ 0.28556874,  0.18287497,  7.74172545, -5.46464716,  3.78005395],
       [-0.80877767,  1.59624561,  2.12994435, -6.556657  ,  3.12170397],
       [-0.19730274,  2.95933609,  7.39315117, -1.0681506 ,  3.32574148],
       [ 0.13256319, -2.83412235, -1.89175901, -2.27355333,  2.69665606],
       [ 0.20554478,  2.21232443,  8.95377185, -3.42675174,  2.2203087 ],
       [ 0.72146428, -0.14211767,  8.99839607, -7.49515898,  2.55218463]])

In [146]:
np.sum(df_numerico)

a     0.972645
b     7.236999
c    43.954549
d   -31.102707
e    21.177676
dtype: float64

In [147]:
np.sum(df_numerico,axis=1)

0    13.188601
1     6.525576
2    -0.517541
3    12.412775
4    -4.170215
5    10.165198
6     4.634768
dtype: float64

In [150]:
np.sum(np.sum(df_numerico))

42.23916276774303

In [151]:
df_numerico

          a         b          c         d         e
0  0.633585  3.262458  10.629319 -4.817788  3.481027
1  0.285569  0.182875   7.741725 -5.464647  3.780054
2 -0.808778  1.596246   2.129944 -6.556657  3.121704
3 -0.197303  2.959336   7.393151 -1.068151  3.325741
4  0.132563 -2.834122  -1.891759 -2.273553  2.696656
5  0.205545  2.212324   8.953772 -3.426752  2.220309
6  0.721464 -0.142118   8.998396 -7.495159  2.552185

In [152]:
np.sin(df_numerico)

          a         b         c         d         e
0  0.592038 -0.120571 -0.933675  0.994451 -0.332954
1  0.281703  0.181857  0.993706  0.730148 -0.595961
2 -0.723444  0.999676  0.847707 -0.270076  0.019887
3 -0.196025  0.181249  0.895684 -0.876311 -0.183110
4  0.132175 -0.302649 -0.948932 -0.763063  0.430401
5  0.204101  0.801182  0.453783  0.281310  0.796379
6  0.660485 -0.141640  0.413579 -0.936311  0.555869

In [153]:
df_numerico["col_6"]=df_numerico["d"]+df_numerico["e"]

In [154]:
df_numerico["d"]

0   -4.817788
1   -5.464647
2   -6.556657
3   -1.068151
4   -2.273553
5   -3.426752
6   -7.495159
Name: d, dtype: float64

In [155]:
df_numerico["e"]

0    3.481027
1    3.780054
2    3.121704
3    3.325741
4    2.696656
5    2.220309
6    2.552185
Name: e, dtype: float64

In [156]:
df_numerico["d"]+df_numerico["e"]

0   -1.336760
1   -1.684593
2   -3.434953
3    2.257591
4    0.423103
5   -1.206443
6   -4.942974
dtype: float64

In [158]:
df_numerico

          a         b          c         d         e     col_6
0  0.633585  3.262458  10.629319 -4.817788  3.481027 -1.336760
1  0.285569  0.182875   7.741725 -5.464647  3.780054 -1.684593
2 -0.808778  1.596246   2.129944 -6.556657  3.121704 -3.434953
3 -0.197303  2.959336   7.393151 -1.068151  3.325741  2.257591
4  0.132563 -2.834122  -1.891759 -2.273553  2.696656  0.423103
5  0.205545  2.212324   8.953772 -3.426752  2.220309 -1.206443
6  0.721464 -0.142118   8.998396 -7.495159  2.552185 -4.942974

In [160]:
np.max(df_numerico,axis=1)

0    10.629319
1     7.741725
2     3.121704
3     7.393151
4     2.696656
5     8.953772
6     8.998396
dtype: float64

## Funciones cualesquiera a nivel de fila: .apply

In [162]:
df_numerico.apply(lambda x: np.max(x),axis=1)

0    10.629319
1     7.741725
2     3.121704
3     7.393151
4     2.696656
5     8.953772
6     8.998396
dtype: float64

In [163]:
df_numerico.apply(lambda x: np.max(x),axis=0)

a         0.721464
b         3.262458
c        10.629319
d        -1.068151
e         3.780054
col_6     2.257591
dtype: float64

cuando utilizamos apply, la función recibe como argumento UNA SERIE. Si hemos hecho axis =1, en cada iteración, la función recibe una fila completa. Si es axis=0, recibe una columna.
Si es axis=1 el índice de la serie son los nombres de las columnas del dataframe.
Si es axis=0, el índice de la serie es el índice del dataframe

In [164]:
def f_cualquiera(x):
    ##Vamos a sumar la columna 2 y la 4. Si esto es mayor que 0, calculamos el máximo. Si no, el mínimo.
    if x['b']+x['d'] >0:
        return np.max(x)
    else:
        return np.min(x)

In [167]:
df_numerico.apply(f_cualquiera,axis=1)

0   -4.817788
1   -5.464647
2   -6.556657
3    7.393151
4   -2.834122
5   -3.426752
6   -7.495159
dtype: float64

#Descritiva de dataframes

In [168]:
df_numerico.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       7 non-null      float64
 1   b       7 non-null      float64
 2   c       7 non-null      float64
 3   d       7 non-null      float64
 4   e       7 non-null      float64
 5   col_6   7 non-null      float64
dtypes: float64(6)
memory usage: 464.0 bytes

In [169]:
df_numerico.describe()

              a         b          c         d         e     col_6
count  7.000000  7.000000   7.000000  7.000000  7.000000  7.000000
mean   0.138949  1.033857   6.279221 -4.443244  3.025382 -1.417861
std    0.519810  2.138829   4.487606  2.312874  0.556291  2.363458
min   -0.808778 -2.834122  -1.891759 -7.495159  2.220309 -4.942974
25%   -0.032370  0.020379   4.761548 -6.010652  2.624420 -2.559773
50%    0.205545  1.596246   7.741725 -4.817788  3.121704 -1.336760
75%    0.459577  2.585830   8.976084 -2.850153  3.403384 -0.391670
max    0.721464  3.262458  10.629319 -1.068151  3.780054  2.257591

In [175]:
df_numerico.describe().loc[["mean","max"],:]

             a         b          c         d         e     col_6
mean  0.138949  1.033857   6.279221 -4.443244  3.025382 -1.417861
max   0.721464  3.262458  10.629319 -1.068151  3.780054  2.257591

In [177]:
df_numerico.describe().iloc[1:-1,:]

             a         b         c         d         e     col_6
mean  0.138949  1.033857  6.279221 -4.443244  3.025382 -1.417861
std   0.519810  2.138829  4.487606  2.312874  0.556291  2.363458
min  -0.808778 -2.834122 -1.891759 -7.495159  2.220309 -4.942974
25%  -0.032370  0.020379  4.761548 -6.010652  2.624420 -2.559773
50%   0.205545  1.596246  7.741725 -4.817788  3.121704 -1.336760
75%   0.459577  2.585830  8.976084 -2.850153  3.403384 -0.391670

In [178]:
df_numerico.loc[[2]]

          a         b         c         d         e     col_6
2 -0.808778  1.596246  2.129944 -6.556657  3.121704 -3.434953

In [179]:
df_numerico.iloc[[2]]

          a         b         c         d         e     col_6
2 -0.808778  1.596246  2.129944 -6.556657  3.121704 -3.434953

In [181]:
df_numerico.index=df_numerico.index+1

In [182]:
df_numerico

          a         b          c         d         e     col_6
1  0.633585  3.262458  10.629319 -4.817788  3.481027 -1.336760
2  0.285569  0.182875   7.741725 -5.464647  3.780054 -1.684593
3 -0.808778  1.596246   2.129944 -6.556657  3.121704 -3.434953
4 -0.197303  2.959336   7.393151 -1.068151  3.325741  2.257591
5  0.132563 -2.834122  -1.891759 -2.273553  2.696656  0.423103
6  0.205545  2.212324   8.953772 -3.426752  2.220309 -1.206443
7  0.721464 -0.142118   8.998396 -7.495159  2.552185 -4.942974

In [183]:
df_numerico.loc[[2]]

          a         b         c         d         e     col_6
2  0.285569  0.182875  7.741725 -5.464647  3.780054 -1.684593

In [184]:
df_numerico.iloc[[2]]

          a         b         c         d         e     col_6
3 -0.808778  1.596246  2.129944 -6.556657  3.121704 -3.434953